{
  "label_mappings_by_name": {
    "Chest pain": "Cardiovascular symptom. Chest pain can be cardiac (MI, angina, pericarditis), pulmonary (PE, pneumonia), gastrointestinal (GERD, esophageal spasm), or musculoskeletal. Requires careful evaluation to rule out life-threatening causes. Common ICD codes: 78650, 78659, R079, R0789. Risk stratification using HEART or TIMI scores.",

    "Coronary atherosclerosis": "Cardiovascular disease. Atherosclerotic heart disease of native coronary arteries, may present with stable/unstable angina or be asymptomatic. Leading cause of myocardial infarction. Common ICD codes: 41401, I25110, I2510. Management includes antiplatelet therapy, statins, beta-blockers, and possible revascularization (PCI/CABG).",

    "Myocardial infarction": "Cardiovascular emergency. Acute coronary syndrome with myocardial necrosis. Includes NSTEMI (non-ST elevation MI) and subendocardial infarction. Common ICD codes: I214, 41071. Requires immediate antiplatelet therapy, anticoagulation, and consideration for cardiac catheterization. Troponin elevation is diagnostic.",

    "Heart failure": "Cardiovascular condition. Heart's inability to pump sufficient blood. Includes acute on chronic systolic/diastolic heart failure and hypertensive heart disease with HF. Common ICD codes: 42833, I110, 42823. Symptoms: dyspnea, orthopnea, peripheral edema. Treatment: diuretics, ACE inhibitors, beta-blockers, possible device therapy.",

    "Atrial fibrillation": "Cardiovascular arrhythmia. Irregular heart rhythm originating from atria. Includes paroxysmal and persistent afib. Common ICD codes: 42731, I480. Risk factors: hypertension, heart disease, hyperthyroidism. Complications: stroke (requires anticoagulation with CHA2DS2-VASc score), heart failure. Rate/rhythm control strategies.",

    "Hypertensive heart disease with CKD": "Cardiovascular-renal condition. Hypertensive heart disease complicated by chronic kidney disease. Common ICD code: I130. Represents cardiorenal syndrome where hypertension affects both heart and kidneys. Requires aggressive BP control, monitoring of renal function, and management of both organ systems.",

    "Sepsis": "Infectious emergency. Life-threatening organ dysfunction caused by dysregulated host response to infection. Common ICD codes: A419, 0389, 389. Requires immediate recognition, blood cultures, broad-spectrum antibiotics, and hemodynamic support. SOFA score for severity. High mortality if not treated urgently.",

    "Pneumonia": "Infectious respiratory condition. Infection of lung parenchyma, organism often unspecified on admission. Common ICD codes: 486, J189. Symptoms: fever, cough, dyspnea, hypoxia. Diagnosis: chest X-ray, elevated WBC. Treatment: empiric antibiotics (consider CURB-65 or PSI for severity). Can progress to sepsis/ARDS.",

    "Urinary tract infection": "Infectious genitourinary condition. Bacterial infection of urinary tract, site often unspecified. Common ICD codes: 5990, N390. Symptoms: dysuria, frequency, urgency, suprapubic pain. Can progress to pyelonephritis or urosepsis. Diagnosis: urinalysis, urine culture. Treatment: antibiotics based on local resistance patterns.",

    "Acute kidney injury": "Renal emergency. Rapid decline in kidney function (increased creatinine, decreased urine output). Common ICD codes: 5849, N179. KDIGO staging based on creatinine and urine output. Causes: prerenal (hypovolemia), intrinsic (ATN, AIN), postrenal (obstruction). May require dialysis in severe cases.",

    "Depression": "Psychiatric condition. Major depressive disorder characterized by persistent low mood, anhedonia, changes in sleep/appetite, concentration difficulties. Common ICD codes: F329, 311. PHQ-9 screening. Treatment: antidepressants (SSRIs, SNRIs), psychotherapy, lifestyle modifications. Monitor for suicidality.",

    "Alcohol use disorder": "Psychiatric/substance use condition. Pattern of alcohol use causing significant impairment or distress. Common ICD codes: 30500, F10129. CAGE screening. Complications: withdrawal (CIWA protocol), cirrhosis, pancreatitis, cardiomyopathy. Treatment: detoxification, counseling, medications (naltrexone, acamprosate, disulfiram).",

    "Chemotherapy encounter": "Oncology encounter. Admission for administration of antineoplastic chemotherapy for cancer treatment. Common ICD codes: Z5111, V5811. Not a diagnosis but encounter reason. Requires monitoring for chemotherapy side effects: neutropenia, nausea/vomiting, mucositis, organ toxicity. Supportive care critical.",

    "Syncope": "Cardiovascular/neurological symptom. Transient loss of consciousness due to cerebral hypoperfusion. Common ICD codes: 7802, R55. Causes: cardiac (arrhythmia, structural), reflex (vasovagal), orthostatic hypotension. Requires evaluation to rule out life-threatening cardiac causes. Risk stratification important.",

    "Aortic valve disorders": "Cardiovascular structural disease. Aortic valve stenosis or other aortic valve abnormalities. Common ICD codes: 4241, I350. Symptoms: dyspnea, angina, syncope (classic triad). Diagnosis: echocardiography showing valve area, gradient. Severe AS requires valve replacement (TAVR or surgical).",

    "Acute pancreatitis": "Gastrointestinal inflammatory condition. Acute inflammation of pancreas. Common ICD code: 5770. Causes: gallstones, alcohol most common. Symptoms: severe epigastric pain radiating to back, nausea/vomiting. Diagnosis: elevated lipase/amylase, imaging. Ranson or BISAP criteria for severity. Complications: necrosis, pseudocyst.",

    "Psychosis": "Psychiatric condition. Loss of contact with reality, unspecified etiology. Common ICD codes: 2989, F29. Symptoms: hallucinations, delusions, disorganized thinking/behavior. Differential: schizophrenia, bipolar with psychotic features, substance-induced, medical causes. Treatment: antipsychotics, treat underlying cause.",

    "Stroke": "Neurological emergency. Cerebral artery occlusion/embolism with brain infarction (ischemic stroke). Common ICD codes: 43491, 43411. Symptoms: sudden focal neurological deficits (FAST screen). NIHSS for severity. Time-critical: consider tPA if <4.5 hours, thrombectomy if large vessel occlusion. Secondary prevention crucial.",

    "COPD": "Respiratory chronic disease. Chronic obstructive pulmonary disease with acute exacerbation. Common ICD codes: 49121, J441. Progressive airflow limitation. Symptoms: dyspnea, chronic cough, sputum. Exacerbation triggers: infection, pollution. Treatment: bronchodilators, steroids, antibiotics if bacterial. GOLD staging. Oxygen if hypoxemic.",

    "Pulmonary embolism": "Cardiovascular/respiratory emergency. Blood clot in pulmonary arteries. Common ICD codes: 41519, I2699. Risk factors: DVT, immobility, cancer, surgery. Symptoms: dyspnea, chest pain, hypoxia, tachycardia. Diagnosis: CT pulmonary angiography, elevated D-dimer. Wells score for probability. Treatment: anticoagulation, thrombolysis if massive PE."
  },

  "label_mappings_by_id": {
    "1": "Cardiovascular: Chest pain - May be cardiac (MI, angina), pulmonary (PE), GI (GERD), or musculoskeletal. Requires careful evaluation. Risk stratification with HEART/TIMI scores.",

    "2": "Cardiovascular: Coronary atherosclerosis - Atherosclerotic heart disease of native coronary arteries. May present with angina or be asymptomatic. Management: antiplatelet, statins, beta-blockers, possible revascularization.",

    "3": "Cardiovascular: Myocardial infarction - Acute coronary syndrome with myocardial necrosis (NSTEMI/subendocardial). Emergency requiring antiplatelet therapy, anticoagulation, cardiac catheterization. Troponin elevation diagnostic.",

    "4": "Cardiovascular: Heart failure - Heart's inability to pump sufficient blood. Acute on chronic systolic/diastolic HF or hypertensive heart disease with HF. Treatment: diuretics, ACE inhibitors, beta-blockers.",

    "5": "Cardiovascular: Atrial fibrillation - Irregular heart rhythm from atria. Stroke risk requires anticoagulation (CHA2DS2-VASc score). Rate/rhythm control strategies.",

    "6": "Cardiovascular-Renal: Hypertensive heart disease with CKD - Hypertension affecting both heart and kidneys (cardiorenal syndrome). Requires aggressive BP control and renal monitoring.",

    "7": "Infectious: Sepsis - Life-threatening organ dysfunction from infection. Emergency requiring cultures, broad-spectrum antibiotics, hemodynamic support. SOFA score for severity.",

    "8": "Infectious-Respiratory: Pneumonia - Lung infection, organism often unspecified. Fever, cough, dyspnea, hypoxia. Treatment: empiric antibiotics. CURB-65 or PSI for severity.",

    "9": "Infectious-Genitourinary: Urinary tract infection - Bacterial UTI, site unspecified. Dysuria, frequency, urgency. Can progress to pyelonephritis/urosepsis. Antibiotics based on local resistance.",

    "10": "Renal: Acute kidney injury - Rapid decline in kidney function. KDIGO staging. Causes: prerenal, intrinsic (ATN), postrenal. May require dialysis.",

    "11": "Psychiatric: Depression - Major depressive disorder with persistent low mood, anhedonia. PHQ-9 screening. Treatment: SSRIs/SNRIs, psychotherapy. Monitor suicidality.",

    "12": "Psychiatric: Alcohol use disorder - Pattern of alcohol use causing impairment. CAGE screening. Complications: withdrawal (CIWA), cirrhosis, pancreatitis. Treatment: detox, counseling, medications.",

    "13": "Oncology: Chemotherapy encounter - Admission for antineoplastic chemotherapy. Monitor for side effects: neutropenia, nausea, mucositis, organ toxicity. Supportive care critical.",

    "14": "Cardiovascular-Neurological: Syncope - Transient loss of consciousness from cerebral hypoperfusion. Causes: cardiac, reflex, orthostatic. Evaluate for life-threatening cardiac causes.",

    "15": "Cardiovascular: Aortic valve disorders - Aortic stenosis or other valve abnormalities. Symptoms: dyspnea, angina, syncope. Severe AS requires valve replacement (TAVR/surgical).",

    "16": "Gastrointestinal: Acute pancreatitis - Pancreatic inflammation. Causes: gallstones, alcohol. Severe epigastric pain radiating to back. Elevated lipase/amylase. Ranson/BISAP for severity.",

    "17": "Psychiatric: Psychosis - Loss of contact with reality, unspecified etiology. Hallucinations, delusions, disorganized thinking. Treatment: antipsychotics, treat underlying cause.",

    "18": "Neurological: Stroke - Cerebral artery occlusion with brain infarction. Sudden focal deficits (FAST). NIHSS for severity. Time-critical: tPA <4.5h, thrombectomy for large vessel.",

    "19": "Respiratory: COPD - Chronic obstructive pulmonary disease with acute exacerbation. Progressive airflow limitation. Treatment: bronchodilators, steroids, antibiotics. GOLD staging.",

    "20": "Cardiovascular-Respiratory: Pulmonary embolism - Blood clot in pulmonary arteries. Risk factors: DVT, immobility, cancer. Diagnosis: CTPA. Wells score. Treatment: anticoagulation, thrombolysis if massive."
  },

  "metadata": {
    "version": "1.0.0",
    "source": "MIMIC-IV v3.1",
    "total_diagnoses": 20,
    "total_cases": 113421,
    "last_updated": "2025-11-13",
    "usage": "Import this file in ClinOrchestra Data Tab for automated label-to-diagnosis context mapping",
    "label_column_options": [
      "consolidated_diagnosis_id (numeric 1-20)",
      "consolidated_diagnosis_name (text)"
    ]
  }
}
